#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.azurerm_log_analytics_workspace.log_workspace: Reading...
data.azurerm_resource_group.main_group: Reading...
data.azurerm_storage_account.log_storage_account: Reading...
data.azurerm_resource_group.main_group: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group]
data.azurerm_virtual_network.virtual_network: Reading...
data.azurerm_storage_account.storage_account_terraform: Reading...
data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/virtualNetworks/fiap-tech-challenge-network]
data.azurerm_subnet.api_subnet: Reading...
data.azurerm_log_analytics_workspace.log_workspace: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-observability-group/providers/Microsoft.OperationalInsights/workspaces/fiap-tech-challenge-observability-workspace]
data.azurerm_storage_account.log_storage_account: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-observability-group/providers/Microsoft.Storage/storageAccounts/sandubalog]
data.azurerm_subnet.api_subnet: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/virtualNetworks/fiap-tech-challenge-network/subnets/fiap-tech-challenge-auth-subnet]
data.azurerm_storage_account.storage_account_terraform: Read complete after 0s [id=/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Storage/storageAccounts/sandubaterraform]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_function_app.linux_function will be created
  + resource "azurerm_linux_function_app" "linux_function" {
      + app_settings                                   = {
          + "AUTH_AUDIENCE"                       = "Users"
          + "AUTH_ISSUER"                         = "Sanduba.Auth"
          + "AUTH_SECRET_KEY"                     = (sensitive value)
          + "ConnectionString"                    = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"         = "~4"
          + "WEBSITES_ENABLE_APP_SERVICE_STORAGE" = "false"
        }
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus"
      + name                                           = "sanduba-auth-function"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "fiap-tech-challenge-auth-group"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "sandubaterraform"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "environment" = "development"
        }
      + virtual_network_subnet_id                      = "/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-main-group/providers/Microsoft.Network/virtualNetworks/fiap-tech-challenge-network/subnets/fiap-tech-challenge-auth-subnet"
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + use_dotnet_isolated_runtime = false

              + docker {
                  + image_name   = "cangelosilima/sanduba-auth.api"
                  + image_tag    = "latest"
                  + registry_url = "https://index.docker.io"
                }
            }
        }
    }

  # azurerm_monitor_diagnostic_setting.function_monitor will be created
  + resource "azurerm_monitor_diagnostic_setting" "function_monitor" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-observability-group/providers/Microsoft.OperationalInsights/workspaces/fiap-tech-challenge-observability-workspace"
      + name                           = "fiap-tech-challenge-auth-monitor"
      + storage_account_id             = "/subscriptions/7c8f5667-0066-47d3-addc-2fa0f9d2d4e3/resourceGroups/fiap-tech-challenge-observability-group/providers/Microsoft.Storage/storageAccounts/sandubalog"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "FunctionAppLogs"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # azurerm_resource_group.resource_group will be created
  + resource "azurerm_resource_group" "resource_group" {
      + id         = (known after apply)
      + location   = "eastus"
      + managed_by = "fiap-tech-challenge-main-group"
      + name       = "fiap-tech-challenge-auth-group"
      + tags       = {
          + "environment" = "development"
        }
    }

  # azurerm_service_plan.auth_plan will be created
  + resource "azurerm_service_plan" "auth_plan" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "auth-app-service-plan"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "fiap-tech-challenge-auth-group"
      + sku_name                     = "B1"
      + tags                         = {
          + "environment" = "development"
        }
      + worker_count                 = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @cangelosilima, Action: `pull_request`*